In [479]:
import pandas as pd

In [481]:
df=pd.read_csv("student.csv")

In [483]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [485]:
df.iloc[2:5,0:5]

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [487]:
df.loc[2:5,['roll','name']]

   roll     name
2     3   aniket
3     4  ajinkya
4     5     asha
5     6   ayesha

In [489]:
type(df.loc[2:5,['name']])

pandas.core.frame.DataFrame

In [491]:
df.loc[0:,'name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

# For accessing entire columns name other method

In [494]:
df['name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

# Drop Method to delete an element

In [497]:
df.drop(3)

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19
4     5    asha    TE  63.28   20
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [499]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [501]:
df.drop([3,4,7])

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [503]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

# default value is 0 we want to delete vertical so axis

In [506]:
df.drop('class',axis=1)

   roll     name  marks  age
0     1     anil  56.77   22
1     2     amit  59.77   21
2     3   aniket  76.88   19
3     4  ajinkya  69.66   20
4     5     asha  63.28   20
5     6   ayesha  49.55   20
6     7     amar  65.34   19
7     8    amita  68.33   23
8     9     amol  56.75   20
9    10    anmol  78.66   21

# Functions

In [509]:
max(df['marks'])

78.66

In [511]:
min(df['marks'])

49.55

In [513]:
max(df['roll'])

10

# Methods on Series

In [516]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

# Series has no attribute starts with so str.

In [519]:
df['name'].str.startswith('an')

0     True
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9     True
Name: name, dtype: bool

In [521]:
df['name'].str.endswith('et')

0    False
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: name, dtype: bool

In [523]:
df['marks'].max()

78.66

In [525]:
df['marks'].std

<bound method Series.std of 0    56.77
1    59.77
2    76.88
3    69.66
4    63.28
5    49.55
6    65.34
7    68.33
8    56.75
9    78.66
Name: marks, dtype: float64>

# add or modify columns

In [528]:
df['roll']=df['roll']+100

In [530]:
df

   roll     name class  marks  age
0   101     anil    TE  56.77   22
1   102     amit    TE  59.77   21
2   103   aniket    BE  76.88   19
3   104  ajinkya    TE  69.66   20
4   105     asha    TE  63.28   20
5   106   ayesha    BE  49.55   20
6   107     amar    BE  65.34   19
7   108    amita    BE  68.33   23
8   109     amol    TE  56.75   20
9   110    anmol    BE  78.66   21

# Add new column

In [533]:
gender=['M','F','M','M','F','F','M','F','M','M']

In [535]:
df['gender']=gender

In [537]:
df

   roll     name class  marks  age gender
0   101     anil    TE  56.77   22      M
1   102     amit    TE  59.77   21      F
2   103   aniket    BE  76.88   19      M
3   104  ajinkya    TE  69.66   20      M
4   105     asha    TE  63.28   20      F
5   106   ayesha    BE  49.55   20      F
6   107     amar    BE  65.34   19      M
7   108    amita    BE  68.33   23      F
8   109     amol    TE  56.75   20      M
9   110    anmol    BE  78.66   21      M

In [539]:
df['cgpa']=df['marks']/10+0.5

In [541]:
df

   roll     name class  marks  age gender   cgpa
0   101     anil    TE  56.77   22      M  6.177
1   102     amit    TE  59.77   21      F  6.477
2   103   aniket    BE  76.88   19      M  8.188
3   104  ajinkya    TE  69.66   20      M  7.466
4   105     asha    TE  63.28   20      F  6.828
5   106   ayesha    BE  49.55   20      F  5.455
6   107     amar    BE  65.34   19      M  7.034
7   108    amita    BE  68.33   23      F  7.333
8   109     amol    TE  56.75   20      M  6.175
9   110    anmol    BE  78.66   21      M  8.366

# delete gender & cgpa column

In [544]:
df.drop(['gender','cgpa'],axis=1,inplace=True)

In [546]:
df

   roll     name class  marks  age
0   101     anil    TE  56.77   22
1   102     amit    TE  59.77   21
2   103   aniket    BE  76.88   19
3   104  ajinkya    TE  69.66   20
4   105     asha    TE  63.28   20
5   106   ayesha    BE  49.55   20
6   107     amar    BE  65.34   19
7   108    amita    BE  68.33   23
8   109     amol    TE  56.75   20
9   110    anmol    BE  78.66   21

In [548]:
newdf = pd.DataFrame({
    'roll': df['roll'],
    'gender': gender,
    'cgpa': (df['marks'] / 10 + 0.5)
})

In [550]:
newdf

   roll gender   cgpa
0   101      M  6.177
1   102      F  6.477
2   103      M  8.188
3   104      M  7.466
4   105      F  6.828
5   106      F  5.455
6   107      M  7.034
7   108      F  7.333
8   109      M  6.175
9   110      M  8.366

In [552]:
df.merge(newdf, on='roll')

   roll     name class  marks  age gender   cgpa
0   101     anil    TE  56.77   22      M  6.177
1   102     amit    TE  59.77   21      F  6.477
2   103   aniket    BE  76.88   19      M  8.188
3   104  ajinkya    TE  69.66   20      M  7.466
4   105     asha    TE  63.28   20      F  6.828
5   106   ayesha    BE  49.55   20      F  5.455
6   107     amar    BE  65.34   19      M  7.034
7   108    amita    BE  68.33   23      F  7.333
8   109     amol    TE  56.75   20      M  6.175
9   110    anmol    BE  78.66   21      M  8.366

In [554]:
newdf1=pd.read_csv("student5.csv")

In [556]:
newdf1

   roll     name class  marks  age
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
2     3  subhash    BE  82.44   21
3     4   sachin    TE  59.33   21
4     5  shalini    TE  63.45   20

In [558]:
pd.concat([df,newdf1],ignore_index=True)

    roll     name class  marks  age
0    101     anil    TE  56.77   22
1    102     amit    TE  59.77   21
2    103   aniket    BE  76.88   19
3    104  ajinkya    TE  69.66   20
4    105     asha    TE  63.28   20
5    106   ayesha    BE  49.55   20
6    107     amar    BE  65.34   19
7    108    amita    BE  68.33   23
8    109     amol    TE  56.75   20
9    110    anmol    BE  78.66   21
10     1   surbhi    TE  67.44   23
11     2    sujay    TE  74.12   22
12     3  subhash    BE  82.44   21
13     4   sachin    TE  59.33   21
14     5  shalini    TE  63.45   20

In [560]:
df

   roll     name class  marks  age
0   101     anil    TE  56.77   22
1   102     amit    TE  59.77   21
2   103   aniket    BE  76.88   19
3   104  ajinkya    TE  69.66   20
4   105     asha    TE  63.28   20
5   106   ayesha    BE  49.55   20
6   107     amar    BE  65.34   19
7   108    amita    BE  68.33   23
8   109     amol    TE  56.75   20
9   110    anmol    BE  78.66   21

In [562]:
df.sort_values(by='marks')

   roll     name class  marks  age
5   106   ayesha    BE  49.55   20
8   109     amol    TE  56.75   20
0   101     anil    TE  56.77   22
1   102     amit    TE  59.77   21
4   105     asha    TE  63.28   20
6   107     amar    BE  65.34   19
7   108    amita    BE  68.33   23
3   104  ajinkya    TE  69.66   20
2   103   aniket    BE  76.88   19
9   110    anmol    BE  78.66   21

In [564]:
df.sort_values(by=['marks','class'],ascending=False)

   roll     name class  marks  age
9   110    anmol    BE  78.66   21
2   103   aniket    BE  76.88   19
3   104  ajinkya    TE  69.66   20
7   108    amita    BE  68.33   23
6   107     amar    BE  65.34   19
4   105     asha    TE  63.28   20
1   102     amit    TE  59.77   21
0   101     anil    TE  56.77   22
8   109     amol    TE  56.75   20
5   106   ayesha    BE  49.55   20

In [566]:
df[df['marks']>60]

   roll     name class  marks  age
2   103   aniket    BE  76.88   19
3   104  ajinkya    TE  69.66   20
4   105     asha    TE  63.28   20
6   107     amar    BE  65.34   19
7   108    amita    BE  68.33   23
9   110    anmol    BE  78.66   21

In [568]:
x=df[(df['marks']>60) & (df['class']=='BE')]

In [570]:
x

   roll    name class  marks  age
2   103  aniket    BE  76.88   19
6   107    amar    BE  65.34   19
7   108   amita    BE  68.33   23
9   110   anmol    BE  78.66   21

In [572]:
x.to_csv("studd_data.csv",index=False)